Repository: unbywyd/az-accessible-elementor-popup
Catalog: versions/1.0.6/welcome/languages/*-welcome-*.po
Languages: he_il

source: Close
he_il: לסגור

source: <u>Only together</u> we can make web content <br /> more <b>accessible</b> to everyone!
he_il: <u>רק ביחד</u> נוכל לעשות את האינטרנט <br /> <b>נגיש</b> יותר!

source: Just a couple of steps and you <u>will contribute to web accessibility!</u>
he_il: רק כמה שלבים כדי לעשות את זה

source: Thank you!
he_il: תודה רבה לך!

source: Thank you for making the Internet accessible to everyone!
he_il: תודה שהפכת את האינטרנט לנגיש לכולם!

source: Do you have accessibility issues or questions? We can help you! The <a target="_blank" href="https://accessibility.zone/"><b>Accessibility Zone</b></a> team is always <u>ready to help you</u> with web accessibility, just <a href="https://accessibility.zone/contact-us">contact us!</a>
he_il: יש לך בעיות נגישות או שאלות? אנחנו יכולים לעזור לך! צוות <a target="_blank" href="https://accessibility.zone/"><b>Accessibility Zone</b></a> תמיד <u>מוכן לעזור לכם</u> עם האינטרנט נגישות, פשוט <a href="https://accessibility.zone/contact-us">צור קשר!</a>

source: Contact Us
he_il: צור קשר

source: Callback
he_il: משוב

source: Would you like to get in touch with us and receive news from us?
he_il: האם רוצה שנודיע לך ונעדכן אותך בחדשות?

source: Your email
he_il: האימייל שלך

source: Your e-mail
he_il: האימייל שלך

source: Tell us which wordpress plugins need web accessibility
he_il: ספר לנו אילו תוספים של וורדפרס צריכים נגישות לאינטרנט

source: About inaccessible plugins
he_il: לגבי תוספים לא נגישים

source: The plugin I'm using and it's not accessible
he_il: התוסף שאני משתמש בו והוא לא נגיש

source: Are you a developer?
he_il: האם את/ה מפתח?

source: Yes
he_il: כן

source: No
he_il: לא

source: To back
he_il: לחזור

source: I'm not interested in anything, close this popup!
he_il: אני לא מעוניין בכלום, סגור את פופאפ הזה!

source: Send
he_il: שלח

source: Skip
he_il: לדלג

source: Next ➝
he_il: הבא

source: Skip and finish
he_il: דלג וסיים

source: check
he_il: לבדוק
